docs/zsh-env.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ZShell Environment Startup File</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="ZShell Environment Startup File"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-04T22:09-0800"/>
<meta name="author" content="Howard Abrams"/>
<meta name="description" content="Global environment variables for ZShell"/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href='http://www.howardism.org/styles/org-export-html-style.css' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">ZShell Environment Startup File</h1>

<p>This startup file is always loaded, even for <i>non-interactive</i> shell
scripts, so this file should be light and only contain environment
variable settings.
</p>
<p>
<b>Note:</b> I could use this to store any functions that I want to share
between my other scripts, but so far I haven't thought of anything.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Environment Variables</h2>
<div class="outline-text-2" id="text-1">


<p>
  Path to the <a href="https://github.com/robbyrussell/oh-my-zsh">Oh My Zsh</a> configuration.
</p>



<pre class="src src-sh"><span style="color: #e7c547;">ZSH</span>=$<span style="color: #e7c547;">HOME</span>/.oh-my-zsh
</pre>


<p>
  Use my own <a href="zsh-theme.html">Happiness Zsh theme</a> (stored in the <code>~/.oh-my-zsh/themes</code>
  directory.
</p>



<pre class="src src-sh"><span style="color: #e7c547;">ZSH_THEME</span>=<span style="color: #70c0b1;">"happiness"</span>
</pre>


<p>
  Set <code>EDITOR</code> to start up an <code>emacsclient</code>:
</p>



<pre class="src src-sh"><span style="color: #c397d8;">export</span> <span style="color: #e7c547;">ALTERNATE_EDITOR</span>=/Applications/Emacs.app/Contents/MacOS/Emacs
<span style="color: #c397d8;">export</span> <span style="color: #e7c547;">EDITOR</span>=/Applications/Emacs.app/Contents/MacOS/bin/emacsclient
<span style="color: #c397d8;">export</span> <span style="color: #e7c547;">VISUAL</span>=<span style="color: #70c0b1;">"$EDITOR -c"</span>
</pre>


<p>
  Disable autosetting terminal title.
</p>



<pre class="src src-sh"><span style="color: #e7c547;">DISABLE_AUTO_TITLE</span>=<span style="color: #70c0b1;">"true"</span>
</pre>


<p>
  Displays red dots while waiting for completion.
</p>



<pre class="src src-sh"><span style="color: #e7c547;">COMPLETION_WAITING_DOTS</span>=<span style="color: #70c0b1;">"true"</span>
</pre>


<p>
  Disable bi-weekly auto-update checks of Oh My Zsh.
  This has caused problems for me. I will update by hand.
</p>



<pre class="src src-sh"><span style="color: #e7c547;">DISABLE_AUTO_UPDATE</span>=<span style="color: #70c0b1;">"true"</span>
</pre>



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">History</h3>
<div class="outline-text-3" id="text-1-1">


<p>
   We will let the <code>HISTFILE</code> variable as it is.
</p>



<pre class="src src-sh"><span style="color: #e7c547;">SAVEHIST</span>=1000
<span style="color: #e7c547;">HISTSIZE</span>=1000
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Path</h3>
<div class="outline-text-3" id="text-1-2">


<p>
   We want to add these directories, but only if they exist. This
   makes this more portable between my computers.
</p>



<pre class="src src-sh"><span style="color: #e7c547;">OLDPATH</span>=$<span style="color: #e7c547;">PATH</span>
<span style="color: #e7c547;">PATH</span>=$<span style="color: #e7c547;">HOME</span>/bin

<span style="color: #b9ca4a;">for</span> DIR<span style="color: #b9ca4a;"> in</span> /web/tools/bin /opt/local/bin /opt/local/sbin /usr/local/bin /usr/local/git/bin
<span style="color: #b9ca4a;">do</span>
  <span style="color: #b9ca4a;">if</span> [[ -d $<span style="color: #e7c547;">DIR</span> ]]
  <span style="color: #b9ca4a;">then</span>
      <span style="color: #e7c547;">PATH</span>=$<span style="color: #e7c547;">PATH</span>:$<span style="color: #e7c547;">DIR</span>
  <span style="color: #b9ca4a;">fi</span>
<span style="color: #b9ca4a;">done</span>

<span style="color: #e7c547;">PATH</span>=$<span style="color: #e7c547;">PATH</span>:$<span style="color: #e7c547;">OLDPATH</span>
</pre>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Options</h2>
<div class="outline-text-2" id="text-2">


<p>
  See <a href="http://linux.die.net/man/1/zshoptions">this page</a> for all options.
  Why would you type 'cd dir' if you could just type 'dir'?
</p>



<pre class="src src-sh">setopt AUTO_CD
</pre>


<p>
  This makes cd = pushd
</p>



<pre class="src src-sh">setopt AUTO_PUSHD
</pre>


<p>
  When you type in things, being case insensitive sounds like a good
  idea:
</p>



<pre class="src src-sh">setopt NO_CASE_GLOB
setopt NO_CASE_MATCH
</pre>


<p>
  I don't like every tab on my terminal sharing the same history.
</p>



<pre class="src src-sh">setopt NO_SHARE_HISTORY
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Technical Gunk</h2>
<div class="outline-text-2" id="text-3">


<p>
  The following are the tangled settings. Type: <code>C-c C-v t</code>
  to create the script file.
</p>

</div>
</div>
</div>

</body>
</html>
